; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	infrared3 - mode
	spectrograph2 - mode
	thermograph1 - mode
	image0 - mode
	infrared4 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation5 - direction
	Star7 - direction
	GroundStation9 - direction
	GroundStation11 - direction
	GroundStation1 - direction
	GroundStation10 - direction
	GroundStation8 - direction
	GroundStation6 - direction
	Star4 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 infrared4)
	(supports instrument0 thermograph1)
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation8)
	(calibration_target instrument0 GroundStation10)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 GroundStation11)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon13)
	(supports instrument1 image0)
	(supports instrument1 infrared4)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 GroundStation6)
	(supports instrument2 infrared4)
	(supports instrument2 infrared3)
	(calibration_target instrument2 Star4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
)
(:goal (and
	(pointing satellite0 Phenomenon12)
	(have_image Phenomenon12 spectrograph2)
	(have_image Phenomenon13 infrared3)
	(have_image Star14 infrared3)
	(have_image Star15 spectrograph2)
))

)

; plan
1. (turn_to satellite1 phenomenon12 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 phenomenon12)
   goals met: 0 of 5
2. (turn_to satellite0 phenomenon12 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon12)
   goals met: 1 of 5
3. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 5
4. (turn_to satellite1 star4 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 star4)
   goals met: 1 of 5
5. (calibrate satellite1 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 1 of 5
6. (turn_to satellite1 phenomenon12 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon12)
   goals met: 1 of 5
7. (take_image satellite1 phenomenon12 instrument1 spectrograph2)
   added: (have_image phenomenon12 spectrograph2)
   goals met: 2 of 5
8. (turn_to satellite1 phenomenon13 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon13)
   goals met: 2 of 5
9. (turn_to satellite1 star15 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 star15)
   goals met: 2 of 5
10. (take_image satellite1 star15 instrument1 spectrograph2)
   added: (have_image star15 spectrograph2)
   goals met: 3 of 5
11. (switch_off instrument1 satellite1)
   deleted: (power_on instrument1)
   added: (power_avail satellite1)
   goals met: 3 of 5
12. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 3 of 5
13. (turn_to satellite1 phenomenon13 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 phenomenon13)
   goals met: 3 of 5
14. (turn_to satellite1 star4 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 star4)
   goals met: 3 of 5
15. (calibrate satellite1 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 3 of 5
16. (turn_to satellite1 phenomenon13 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon13)
   goals met: 3 of 5
17. (take_image satellite1 phenomenon13 instrument2 infrared3)
   added: (have_image phenomenon13 infrared3)
   goals met: 4 of 5
18. (turn_to satellite1 star14 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 star14)
   goals met: 4 of 5
19. (take_image satellite1 star14 instrument2 infrared3)
   added: (have_image star14 infrared3)
   goals met: 5 of 5
